Revit 2024 API
PathReinforcement.IsAlternatingLayerEnabled Method
 Checks if alternating bars are present in Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsAlternatingLayerEnabled()
Visual Basic
Public Function IsAlternatingLayerEnabled As Boolean
Visual C++
public:
bool IsAlternatingLayerEnabled()
Return Value
 True if the alternating bars exist in Path Reinforcement instance.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace